controltheory/beamer/7/7_3_z.tex
% Created 2016-11-21 Mon 18:44
\documentclass[table]{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage[usenames]{color}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<article>{\usepackage{beamerarticle}}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{Z变换}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}












\section{Z变换}
\label{sec-1}
\begin{frame}
\frametitle{Z变换定义}
\label{sec-1-1}

\begin{itemize}
\item 采样信号  $e^*(t)$  的Laplace变换  
      \[E^*(s)=\sum_{n=0}^{\infty}e(nT)e^{-nsT}\]
\item <2->令  $Z=e^{sT}$ ,则  
      \[e^{-nsT}=Z^{-n}\]
\item <3->得:  
      \[E(Z)=\sum_{n=0}^{\infty}e(nT)Z^{-n}\]
\item <3->记作  
      \[E(Z)={\cal Z}[e^*(t)]={\cal Z}[e(t)]\]
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Z变换计算}
\label{sec-1-2}

\begin{itemize}
\item 级数求和法
\begin{itemize}
\item 按照Z变换的定义求解
\end{itemize}
\item 部分分式法:
\begin{itemize}
\item 先求出  $e(t)$  的Laplace变换  $E(s)$  ,将其展开成部分分式之和,使每部分对应的Z变换是已知的.
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{级数求和法示例: $\delta_T(t)=\sum_{n=0}^{\infty}\delta(t-nT)$}
\label{sec-1-3}

\begin{itemize}
\item <2->解:
     \begin{eqnarray*}
     e^*(t) & = & \sum_{n=0}^{\infty}e(nT)\delta(t-nT) \\
      &=& \sum_{n=0}^{\infty}\delta(t-nT) \\
     e(nT) &=& 1\\
     E(z) &=& \sum_{n=0}^{\infty}z^{-n}\\
      &=& \frac{1}{1-z^{-1}} \\
     &=& \frac{z}{z-1}
     \end{eqnarray*}
     其中 $\qquad |z^{-1}|<1$
\item <3->$1(t)$  与  $\delta_T(t)$  对应的Z变换相同.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{级数求和法示例: 单位阶跃信号 $1(t)$}
\label{sec-1-4}

\begin{itemize}
\item <2-> 解: 
      \begin{eqnarray*}
      e(nT)&=&1 , \\
      E(z) &=  &\sum_{n=0}^{\infty}e(nT)z^{-n} \\
       &=& \sum_{n=0}^{\infty}z^{-n} \\
      &=& \frac{1}{1-z^{-1}} \\
      &=& \frac{z}{z-1}
      \end{eqnarray*}
      其中  $\qquad |z^{-1}|<1$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{部分分式法示例:  $E(s)=\frac{a}{s(s+a)}$}
\label{sec-1-5}

\begin{itemize}
\item <2->解:
     \begin{eqnarray*}
     E(s) & = & \frac{1}{s}-\frac{1}{s+a}\\
     e(t) &=& 1-e^{-at} \\
     E(z) &=& \frac{1}{1-z^{-1}} -\frac{1}{1-z^{-1}e^{-aT}}
     \end{eqnarray*}
\item <3->Z变换表:
     \[\begin{matrix}
     \delta(t) & 1 & 1 \\
     1(t) & \frac{1}{s} & \frac{1}{1-z^{-1}} \\
     t & \frac{1}{s^2} & \frac{Tz^{-1}}{(1-z^{-1})^2} \\
     e^{-at} & \frac{1}{s+a} &\frac{1}{1-e^{-aT}z^{-1}}
     \end{matrix}\]
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Z变换性质}
\label{sec-1-6}

\begin{itemize}
\item <2->线性定理:    ${\cal Z}[\alpha e_1(t)+\beta e_2(t)]=\alpha E_1(z)+\beta E_2(z)$
\item <3->实数位移定理:  ${\cal Z}[e(t+kT)] = z^k[E(z)-\sum_{n=0}^{k-1}e(nT)z^{-n}]$
\item <4->复数位移定理:  ${\cal Z}[e^{\pm at}e(t)] = E(ze^{\mp aT})$
\item <5->终值定理:  $\lim_{n\rightarrow\infty}e(nT)=\lim_{z\rightarrow 1}(1-z^{-1})E(z)$
\item <6->卷积定理: 若  $g(nT)=x(nT)*y(nT)$  则  $G(z)=X(z)Y(z)$  . ($x(nT)*y(nT)=\sum_{k=0}^{\infty}x(kT)y((n-k)T)$)
\end{itemize}
\end{frame}
\section{Z反变换}
\label{sec-2}
\begin{frame}
\frametitle{Z反变换}
\label{sec-2-1}

 \[e(nT)={\cal Z}^{-1}[E(z)]\]
\begin{itemize}
\item 幂级数展开法
\item 部分分式法
\begin{itemize}
\item 展开成部分分式后查表
\end{itemize}
\item 反演积分法
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{幂级数展开法}
\label{sec-2-2}

\begin{eqnarray*}
E(z) & = &\frac{b_0+b_1 z^{-1}+\cdots+b_m z^{-m}}{1+a_1 z^{-1}+\cdots+a_n z^{-n}} \\
 &=& c_0+c_1 z^{-1}+\cdots +c_n z^{-n} \\
 &=& \sum_{n=0}^{\infty}c_n z^{-n} \\
e^{*}(t) &=& \sum_{n=0}^{\infty}c_n\delta(t-nT) \\
e(nT) &=& c_n 
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{反演积分法}
\label{sec-2-3}

\begin{eqnarray*}
E(z) & = & \sum_{n=0}^{\infty}e(nT)z^{-n} \\
  &=& e(0)+e(T)z^{-1}+\cdots+e(nT)z^{-n}+\cdots \\
E(z)z^{n-1} &=& e(0)z^{n-1}+e(T)z^{n-2}+\cdots+e(nT)z^{-1}+\cdots \\
e(nT)&=& Res(E(z)z^{n-1})
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{反演积分法示例:  $E(z)=\frac{z^2}{(z-1)(z-0.5)}$  求  $e(nT)$}
\label{sec-2-4}

\begin{itemize}
\item <2->解:
     \begin{eqnarray*}
     E(z)z^{n-1} & = &\frac{z^{n+1}}{(z-1)(z-0.5)} \\
     Res_1 &=& \lim_{z\rightarrow 1}\frac{(z-1)z^{n+1}}{(z-1)(z-0.5)} \\
        &=& 2 \\
     Res_2 &=& \lim_{z\rightarrow 0.5}\frac{(z-0.5)z^{n+1}}{(z-1)(z-0.5)} \\
        &=& -0.5^n \\
     e(nT) &=& Res_1+Res_2 \\
      &=& 2-0.5^n
     \end{eqnarray*}
\end{itemize}
\end{frame}

\end{document}
